# Домашнее задание
## Основы pandas

**Задание 1**


Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

In [1]:
import pandas as pd

In [2]:
movies = pd.read_csv('ml-latest-small/movies.csv')
ratings = pd.read_csv('ml-latest-small/ratings.csv')
movies.head(3)

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance

In [3]:
# v1 from separate tables

highest_rated_movieId = ratings.query('rating == 5.0').movieId.value_counts().keys()[0]
movies[movies.movieId == highest_rated_movieId]

     movieId                             title       genres
277      318  Shawshank Redemption, The (1994)  Crime|Drama

In [4]:
# v2 - with merge

joined = ratings.merge(movies, on='movieId', how='left')
joined.query('rating == 5.0').groupby(['movieId', 'title', 'genres']).count().sort_values('rating', ascending=False).filter(items = ['movieId', 'title', 'genres']).head(1)

Empty DataFrame
Columns: []
Index: [(318, Shawshank Redemption, The (1994), Crime|Drama)]

**Задание 2**


По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [5]:
power = pd.read_csv('power.csv')
power.head(3)

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1

In [6]:
countries = ['Estonia', 'Latvia', 'Lithuania']
categories = [4, 12, 21]

baltic = power.query(f'quantity > 0 & country in {countries} & category in {categories} & 2005 <= year <= 2010')
baltic.sum()['quantity']

240580.0

**Задание 3**


Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.
Примеры страниц (необязательно брать именно эти): 
https://fortrader.org/quotes
https://www.finanz.ru/valyuty/v-realnom-vremeni

In [7]:
pd.read_html('https://finance.yahoo.com/quote/SPLK/history', attrs = {'class': 'W(100%) M(0)'})[0].head(10)

           Date    Open    High     Low  Close* Adj Close**   Volume
0  Jan 28, 2020  153.85  156.46  153.09  155.57      155.57  1350800
1  Jan 27, 2020  153.53  154.99  151.04  153.59      153.59  1370500
2  Jan 24, 2020  159.41  160.98  156.41  157.00      157.00   910200
3  Jan 23, 2020  156.55  158.42  155.00  157.84      157.84  1491800
4  Jan 22, 2020  158.24  159.24  156.18  156.44      156.44  1084200
5  Jan 21, 2020  157.83  159.25  156.74  157.10      157.10  1053000
6  Jan 17, 2020  161.49  161.49  156.00  157.96      157.96  1641000
7  Jan 16, 2020  157.71  160.43  156.74  160.32      160.32  1527700
8  Jan 15, 2020  157.57  158.37  155.53  156.02      156.02  1471000
9  Jan 14, 2020  155.71  158.70  155.37  157.04      157.04  1461600